swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom/rtl8735b_ecdsa.c
/**************************************************************************//**
 * @file     rtl8710C_crypto.c
 * @brief    This file implements the CRYPTO Secure and Non-secure HAL functions in ROM.
 *
 * @version  V1.00
 * @date     2020-08-20
 *
 * @note
 *
 ******************************************************************************
 *
 * Copyright(c) 2007 - 2017 Realtek Corporation. All rights reserved.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 ******************************************************************************/

#include "cmsis.h"
#include "rtl8735b_ecdsa.h"

#if CONFIG_ECDSA_EN

#define SECTION_ECDSA_TEXT           SECTION(".rom.hal_ecdsa.text")
#define SECTION_ECDSA_DATA           SECTION(".rom.hal_ecdsa.data")
#define SECTION_ECDSA_RODATA         SECTION(".rom.hal_ecdsa.rodata")
#define SECTION_ECDSA_BSS            SECTION(".rom.hal_ecdsa.bss")
#define SECTION_ECDSA_STUBS          SECTION(".rom.hal_ecdsa.stubs")

/**
 * @addtogroup hal_rtl_ecdsa ECDSA
 * @{
 */

/**
  * @brief The global common data structure to store common resource
  *        for ECDSA adapters.
  */
SECTION_ECDSA_BSS hal_ecdsa_group_adapter_t ecdsa_group_adapter;

/**
 * @addtogroup hal_rtl_ecdsa_func ECDSA HAL ROM APIs.
 * @ingroup hal_ecdsa
 * @{
 * @brief The ECDSA HAL ROM APIs. The user application(in RAM space) should not call these APIs directly.
 *        There is another set of ECDSA HAL APIs in the RAM space is provided for the user application.
 */

/**
  * @brief The stubs functions table to exports ECDSA HAL functions in ROM.
  */
SECTION_ECDSA_STUBS const hal_ecdsa_func_stubs_t hal_ecdsa_stubs = {
	.pecdsa_group_adapter = &ecdsa_group_adapter,
	.hal_ecdsa_irq_reg = hal_rtl_ecdsa_irq_reg,
	.hal_ecdsa_irq_unreg = hal_rtl_ecdsa_irq_unreg,
	.hal_ecdsa_init_clk_ctrl = hal_rtl_ecdsa_init_clk_ctrl,
	.hal_ecdsa_deinit_clk_ctrl = hal_rtl_ecdsa_deinit_clk_ctrl,
	.hal_ecdsa_init = hal_rtl_ecdsa_init,
	.hal_ecdsa_deinit = hal_rtl_ecdsa_deinit,
	.hal_ecdsa_reset = hal_rtl_ecdsa_reset,
	.hal_ecdsa_clr_finish_int = hal_rtl_ecdsa_clr_finish_int,
	.hal_ecdsa_mask_finish_int = hal_rtl_ecdsa_mask_finish_int,
	.hal_ecdsa_set_curve = hal_rtl_ecdsa_set_curve,
	.hal_ecdsa_set_mode = hal_rtl_ecdsa_set_mode,
	.hal_ecdsa_set_bit_num = hal_rtl_ecdsa_set_bit_num,
	.hal_ecdsa_start_en = hal_rtl_ecdsa_start_en,
	.hal_ecdsa_hash_en = hal_rtl_ecdsa_hash_en,
	.hal_ecdsa_hash_256_en = hal_rtl_ecdsa_hash_256_en,
	.hal_ecdsa_select_prk = hal_rtl_ecdsa_select_prk,
	.hal_ecdsa_set_prk = hal_rtl_ecdsa_set_prk,
	.hal_ecdsa_set_random_k = hal_rtl_ecdsa_set_random_k,
	.hal_ecdsa_set_pbk = hal_rtl_ecdsa_set_pbk,
	.hal_ecdsa_set_hash = hal_rtl_ecdsa_set_hash,
	.hal_ecdsa_set_rs = hal_rtl_ecdsa_set_rs,
	.hal_ecdsa_set_base_point = hal_rtl_ecdsa_set_base_point,
	.hal_ecdsa_set_base_point_2 = hal_rtl_ecdsa_set_base_point_2,
	.hal_ecdsa_set_cor_a = hal_rtl_ecdsa_set_cor_a,
	.hal_ecdsa_set_prime = hal_rtl_ecdsa_set_prime,
	.hal_ecdsa_set_order_n = hal_rtl_ecdsa_set_order_n,
	.hal_ecdsa_get_result_x_y = hal_rtl_ecdsa_get_result_x_y,
	.hal_ecdsa_get_veri_result = hal_rtl_ecdsa_get_veri_result,
	.hal_ecdsa_get_veri_err_sta = hal_rtl_ecdsa_get_veri_err_sta,
	.hal_ecdsa_get_finish_sta = hal_rtl_ecdsa_get_finish_sta,
	.hal_ecdsa_get_pbk = hal_rtl_ecdsa_get_pbk,
	.hal_ecdsa_get_rs = hal_rtl_ecdsa_get_rs,
	.hal_ecdsa_get_sign_err_sta = hal_rtl_ecdsa_get_sign_err_sta,
	.hal_ecdsa_get_scal_mul_err_sta = hal_rtl_ecdsa_get_scal_mul_err_sta,
	.hal_ecdsa_get_err_sta = hal_rtl_ecdsa_get_err_sta,
	.hal_ecdsa_get_idel_sta = hal_rtl_ecdsa_get_idle_sta,
	.hal_ecdsa_verify = hal_rtl_ecdsa_verify,
	.hal_ecdsa_signature = hal_rtl_ecdsa_signature,
	.hal_ecdsa_hash = hal_rtl_ecdsa_hash,
	.hal_ecdsa_gen_public_key = hal_rtl_ecdsa_gen_public_key,
	.hal_ecdsa_cb_handler = hal_rtl_ecdsa_cb_handler,
};

/**
 *  @brief This is the common interrupt handler for ECDSA.
 *         It read the system register to know the interrupt event
 *         is triggered by which ECDSA device.
 *
 *  @returns void
 */
SECTION_ECDSA_TEXT
void ECDSA_IRQHandler(void)
{
	hal_ecdsa_adapter_t *pecdsa_adapter;

	hal_rtl_irq_clear_pending(ECDSA_IRQn);

	pecdsa_adapter = ecdsa_group_adapter.pecdsa_adapter[ECDSA_id];

	hal_rtl_ecdsa_clr_finish_int(pecdsa_adapter);
	//-------------------------------------------
	//Input callback function
	if (pecdsa_adapter->ecdsa_irq_user_cb != NULL) {
		pecdsa_adapter->ecdsa_irq_user_cb(pecdsa_adapter->ecdsa_user_arg);
	}
	//-------------------------------------------

}

/**
 *  @brief To register a IRQ handler for ECDSA.
 *
 *  @returns void
 */
SECTION_ECDSA_TEXT
void hal_rtl_ecdsa_irq_reg(void)
{
	hal_rtl_irq_disable(ECDSA_IRQn);
	__ISB();

	// Register ECDSA common IRQ handler
	hal_rtl_irq_set_vector(ECDSA_IRQn, (uint32_t)ECDSA_IRQHandler);
	hal_rtl_irq_clear_pending(ECDSA_IRQn);
	hal_rtl_irq_enable(ECDSA_IRQn);
}

/**
 *  @brief To un-register the ECDSA IRQ handler.
 *
 *  @param[in]  pecdsa_adapter The ECDSA adapter.
 *
 *  @returns void
 */
SECTION_ECDSA_TEXT
void hal_rtl_ecdsa_irq_unreg(void)
{
	// No any ECDSA port has IRQ handler, so disable the common interrupt
	hal_rtl_irq_disable(ECDSA_IRQn);
	__ISB();
}

/**
 *  @brief Init ECDSA clock control.
 *
 *  @param[in]  pecdsa_adapter The ECDSA adapter.
 *
 *  @returns void
 */
SECTION_ECDSA_TEXT
void hal_rtl_ecdsa_init_clk_ctrl(hal_ecdsa_adapter_t *pecdsa_adapter)
{
#if !defined(CONFIG_BUILD_NONSECURE)
	ECDSA_TypeDef *pecdsa_reg = (ECDSA_TypeDef *)pecdsa_adapter->base_addr;
	hal_rtl_sys_peripheral_en(ECDSA_SYS, ENABLE);
	pecdsa_reg->ECDSA_ECR1_REG |= ECDSA_BIT_ENG_CLK_ENABLE;
	hal_rtl_ecdsa_reset(pecdsa_adapter);
#endif
}

/**
 *  @brief De-init ECDSA clock control.
 *
 *  @param[in]  pecdsa_adapter The ECDSA adapter.
 *
 *  @returns void
 */
SECTION_ECDSA_TEXT
void hal_rtl_ecdsa_deinit_clk_ctrl(hal_ecdsa_adapter_t *pecdsa_adapter)
{
#if !defined(CONFIG_BUILD_NONSECURE)
	ECDSA_TypeDef *pecdsa_reg = (ECDSA_TypeDef *)pecdsa_adapter->base_addr;
	hal_rtl_ecdsa_reset(pecdsa_adapter);
	pecdsa_reg->ECDSA_ECR1_REG &= ~(ECDSA_BIT_ENG_CLK_ENABLE);
	hal_rtl_sys_peripheral_en(ECDSA_SYS, DISABLE);
#endif
}

/**
 *  @brief Initialize the ECDSA hardware and turn on the ECDSA
 *
 *  @param[in] pecdsa_adapter The ECDSA adapter.
 *
 *  @return     HAL_ERR_PARA
 *  @return     HAL_OK
 */
SECTION_ECDSA_TEXT
HAL_Status hal_rtl_ecdsa_init(hal_ecdsa_adapter_t *pecdsa_adapter)
{
	uint8_t i;
	uint8_t result = 0x00;

	//Check if ECDSA has been registered.
	for (i = 0; i < ECDSA_Max_Id; i++) {
		if (ecdsa_group_adapter.pecdsa_adapter[i] != NULL) {
			DBG_ECDSA_ERR("The ecdsa had been registered. \r\n");
			result = 1;
			break;
		}
	}

