swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom/rtl8735b_ecdsa.c
	if (result == 0x00) {

		hal_rtl_ecdsa_irq_reg();

		//Set IRQ priority
		hal_rtl_irq_set_priority(ECDSA_IRQn, ECDSA_IRQPri);

		pecdsa_adapter->base_addr = (ECDSA_TypeDef *)ECDSA;
		ecdsa_group_adapter.pecdsa_adapter[ECDSA_id] = pecdsa_adapter;

		hal_rtl_ecdsa_init_clk_ctrl(pecdsa_adapter);

		return HAL_OK;
	} else {

		return HAL_ERR_PARA;
	}

}

/**
 *  @brief De-initialize of the ECDSA hardware and turn off the ECDSA.
 *
 *  @param[in] pecdsa_adapter The ECDSA adapter.
 *
 *  @return     HAL_ERR_PARA
 *  @return     HAL_OK
 */
SECTION_ECDSA_TEXT
HAL_Status hal_rtl_ecdsa_deinit(hal_ecdsa_adapter_t *pecdsa_adapter)
{
	if (pecdsa_adapter == 0) {
		DBG_ECDSA_ERR("hal_rtl_ecdsa_deinit: Null Pointer\r\n");
		return HAL_ERR_PARA;
	}

	/*ECDSA Interrupt DeInitialization*/
	hal_rtl_ecdsa_irq_unreg();

	hal_rtl_ecdsa_deinit_clk_ctrl(pecdsa_adapter);

	ecdsa_group_adapter.pecdsa_adapter[ECDSA_id] = NULL;

	return HAL_OK;
}

/**
 *  @brief Reset the ECDSA.
 *
 *  @param[in] pecdsa_adapter The ECDSA adapter.
 *
 *  @returns void
 */
SECTION_ECDSA_TEXT
void hal_rtl_ecdsa_reset(hal_ecdsa_adapter_t *pecdsa_adapter)
{
	ECDSA_TypeDef *pecdsa_reg = (ECDSA_TypeDef *)pecdsa_adapter->base_addr;

	pecdsa_reg->ECDSA_ECR1_REG |= ECDSA_BIT_ENG_RST;
	pecdsa_reg->ECDSA_ECR1_REG &= ~(ECDSA_BIT_ENG_RST);
}

/**
 *  @brief Clear the finish interrupt of ECDSA
 *
 *  @returns void
 */
SECTION_ECDSA_TEXT
void hal_rtl_ecdsa_clr_finish_int(hal_ecdsa_adapter_t *pecdsa_adapter)
{
	ECDSA_TypeDef *pecdsa_reg = (ECDSA_TypeDef *)pecdsa_adapter->base_addr;

	pecdsa_reg->ECDSA_EISR_REG |= ECDSA_BIT_FINISH_INT;
}

/**
 *  @brief Mask the finish interrupt of ECDSA
 *
 *  @returns void
 */
SECTION_ECDSA_TEXT
void hal_rtl_ecdsa_mask_finish_int(hal_ecdsa_adapter_t *pecdsa_adapter, uint8_t enable)
{
	ECDSA_TypeDef *pecdsa_reg = (ECDSA_TypeDef *)pecdsa_adapter->base_addr;

	if (enable == 1) {
		pecdsa_reg->ECDSA_ECR2_REG |= ECDSA_BIT_FINISH_INT_MASK;
	} else {
		pecdsa_reg->ECDSA_ECR2_REG &= ~(ECDSA_BIT_FINISH_INT_MASK);
	}
}

/**
 *  @brief Set the ECDSA curve.
 *
 *  @param[in] pecdsa_adapter The ECDSA adapter.
 *  @param[in] curve Select an elliptic curve.
 *  @param[in] pcurve_table Set the curve table address.
 *  @param[in] bit_num Select the bit length.
 *
 *  @returns void
 */
SECTION_ECDSA_TEXT
void hal_rtl_ecdsa_set_curve(hal_ecdsa_adapter_t *pecdsa_adapter, ecdsa_curve_t curve, hal_ecdsa_curve_table_t *pcurve_table, ecdsa_bit_num_t bit_num)
{
	ECDSA_TypeDef *pecdsa_reg = (ECDSA_TypeDef *)pecdsa_adapter->base_addr;
	uint32_t temp_reg;

	temp_reg = pecdsa_reg->ECDSA_ECR2_REG;

	temp_reg &= ~(ECDSA_MASK_CURVE_SEL);

	temp_reg |= (curve << ECDSA_SHIFT_CURVE_SEL);

	pecdsa_reg->ECDSA_ECR2_REG = temp_reg;

	if (curve == ECDSA_OTHERS) {

		if (pcurve_table != NULL) {
			hal_rtl_ecdsa_set_base_point(pecdsa_adapter, pcurve_table->ppoint_x, pcurve_table->ppoint_y);

			hal_rtl_ecdsa_set_cor_a(pecdsa_adapter, pcurve_table->pa_adr);

			hal_rtl_ecdsa_set_prime(pecdsa_adapter, pcurve_table->pprime);

			hal_rtl_ecdsa_set_order_n(pecdsa_adapter, pcurve_table->porder_n);
		} else {
			DBG_ECDSA_ERR("Need to set the curve parameter. \r\n");
		}

		hal_rtl_ecdsa_set_bit_num(pecdsa_adapter, bit_num);
	}

}

/**
 *  @brief Set the ECDSA mode.
 *
 *  @param[in] pecdsa_adapter The ECDSA adapter.
 *  @param[in] mode Select an operation mode.
 *  @param[in] func If the operating mode is ECDSA_BASIC_FUNC, need to set this operation unit.
 *
 *  @returns void
 */
SECTION_ECDSA_TEXT
void hal_rtl_ecdsa_set_mode(hal_ecdsa_adapter_t *pecdsa_adapter, ecdsa_mode_t mode, ecdsa_basic_func_t func)
{
	ECDSA_TypeDef *pecdsa_reg = (ECDSA_TypeDef *)pecdsa_adapter->base_addr;
	uint32_t temp_reg;

	if (func == ECDSA_NONE) {
		func = ECDSA_FIELD_SUB;
	}

	temp_reg = pecdsa_reg->ECDSA_ECR2_REG;

	temp_reg &= ~(ECDSA_MASK_MODE_SEL | ECDSA_MASK_FUNC_SEL);

	temp_reg |= (mode << ECDSA_SHIFT_MODE_SEL) | (func << ECDSA_SHIFT_FUNC_SEL);

	pecdsa_reg->ECDSA_ECR2_REG = temp_reg;
}

/**
 *  @brief Set the basic function of ECDSA.
 *
 *  @param[in] pecdsa_adapter The ECDSA adapter.
 *  @param[in] bit_num Select the bit length.
 *
 *  @returns void
 */
SECTION_ECDSA_TEXT
void hal_rtl_ecdsa_set_bit_num(hal_ecdsa_adapter_t *pecdsa_adapter, ecdsa_bit_num_t bit_num)
{
	ECDSA_TypeDef *pecdsa_reg = (ECDSA_TypeDef *)pecdsa_adapter->base_addr;
	uint32_t temp_reg;
	uint32_t extend_temp;

	if ((bit_num & 0x8) == 0x00) {
		extend_temp = 0;
	} else {
		extend_temp = 1;
	}

	bit_num &= 0x7;

	temp_reg = pecdsa_reg->ECDSA_ECR2_REG;

	temp_reg &= ~(ECDSA_MASK_NUM | ECDSA_BIT_EXTEND_N);

	temp_reg |= (bit_num << ECDSA_SHIFT_NUM) | (extend_temp << ECDSA_SHIFT_EXTEND_N);

	pecdsa_reg->ECDSA_ECR2_REG = temp_reg;

}

/**
 *  @brief To enable or disable the ECDSA engine.
 *
 *  @param[in] pecdsa_adapter The ECDSA adapter.
 *  @param[in] enable Enable control: 0 is disable, 1 is enable.
 *
 *  @returns void
 */
SECTION_ECDSA_TEXT
void hal_rtl_ecdsa_start_en(hal_ecdsa_adapter_t *pecdsa_adapter, uint8_t enable)
{
	ECDSA_TypeDef *pecdsa_reg = (ECDSA_TypeDef *)pecdsa_adapter->base_addr;

	if (enable == 1) {
		pecdsa_reg->ECDSA_EISR_REG |= ECDSA_BIT_ENG_START;
	} else {
		pecdsa_reg->ECDSA_EISR_REG &= ~(ECDSA_BIT_ENG_START);
	}
}

/**
 *  @brief To enable or disable the ECDSA hask ok.
 *
 *  @param[in] pecdsa_adapter The ECDSA adapter.
 *  @param[in] enable Enable control: 0 is that hash is ready, 1 is that hash is not ready.
 *
 *  @returns void
 */
SECTION_ECDSA_TEXT
void hal_rtl_ecdsa_hash_en(hal_ecdsa_adapter_t *pecdsa_adapter, uint8_t enable)
{
	ECDSA_TypeDef *pecdsa_reg = (ECDSA_TypeDef *)pecdsa_adapter->base_addr;

	if (enable == 1) {
		pecdsa_reg->ECDSA_EISR_REG |= ECDSA_BIT_HASH_OK;
	} else {
		pecdsa_reg->ECDSA_EISR_REG &= ~(ECDSA_BIT_HASH_OK);
	}
}

/**
 *  @brief Force the hash length is 256 bits, and seed up the operation.
 *
 *  @param[in] pecdsa_adapter The ECDSA adapter.
 *  @param[in] enable Enable control: 0 is disable, 1 is enable.
 *
 *  @returns void
 */
SECTION_ECDSA_TEXT
void hal_rtl_ecdsa_hash_256_en(hal_ecdsa_adapter_t *pecdsa_adapter, uint8_t enable)
{
	ECDSA_TypeDef *pecdsa_reg = (ECDSA_TypeDef *)pecdsa_adapter->base_addr;

	if (enable == 1) {
		pecdsa_reg->ECDSA_ECR2_REG |= ECDSA_BIT_HASH256_EN;
	} else {
		pecdsa_reg->ECDSA_ECR2_REG &= ~(ECDSA_BIT_HASH256_EN);
	}

