swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom/rtl8735b_ecdsa.c
}

/**
 *  @brief Select the private key of ECDSA.
 *
 *  @param[in] pecdsa_adapter The ECDSA adapter.
 *  @param[in] sel_prk Select the private key.
 *
 *  @returns void
 */
SECTION_ECDSA_TEXT
void hal_rtl_ecdsa_select_prk(hal_ecdsa_adapter_t *pecdsa_adapter, ecdsa_sel_prk_t sel_prk)
{
	ECDSA_TypeDef *pecdsa_reg = (ECDSA_TypeDef *)pecdsa_adapter->base_addr;
	uint32_t reg_temp;

	reg_temp = pecdsa_reg->ECDSA_ECR2_REG;
	reg_temp &= ~(ECDSA_MASK_PRI_KEY_SEL);
	reg_temp |= (sel_prk << ECDSA_SHIFT_PRI_KEY_SEL);
	pecdsa_reg->ECDSA_ECR2_REG = reg_temp;
}

/**
 *  @brief Set the private key of ECDSA.
 *
 *  @param[in] pecdsa_adapter The ECDSA adapter.
 *  @param[in] ppriv_key Set the private key.
 *
 *  @returns void
 */
SECTION_ECDSA_TEXT
void hal_rtl_ecdsa_set_prk(hal_ecdsa_adapter_t *pecdsa_adapter, uint32_t *ppriv_key)
{
	ECDSA_TypeDef *pecdsa_reg = (ECDSA_TypeDef *)pecdsa_adapter->base_addr;
	uint32_t *paddress_temp;
	uint8_t i;
	uint8_t mode_temp;
	uint8_t no_load = 0;

	mode_temp = ((pecdsa_reg->ECDSA_ECR2_REG) & ECDSA_MASK_MODE_SEL) >> ECDSA_SHIFT_MODE_SEL;

	if (mode_temp == ECDSA_SIGN) {
		paddress_temp = (uint32_t *)(&(pecdsa_reg->ECDSA_ENG_X_P0_REG));
	} else if (mode_temp == ECDSA_SCALAR_MUL) {
		paddress_temp = (uint32_t *)(&(pecdsa_reg->ECDSA_ENG_H_P0_REG));
	} else {
		DBG_ECDSA_WARN("This mode doesn't need the private key. \r\n");
		no_load = 1;
	}

	if (no_load == 0x00) {
		for (i = 0; i < 8; i++) {
			*(paddress_temp + i) = *(ppriv_key + i);
		}
	}

}

/**
 *  @brief Set the random k of ECDSA.
 *
 *  @param[in] pecdsa_adapter The ECDSA adapter.
 *  @param[in] prdk Set the random k.
 *
 *  @returns void
 */
SECTION_ECDSA_TEXT
void hal_rtl_ecdsa_set_random_k(hal_ecdsa_adapter_t *pecdsa_adapter, uint32_t *prdk)
{
	ECDSA_TypeDef *pecdsa_reg = (ECDSA_TypeDef *)pecdsa_adapter->base_addr;
	uint32_t *paddress_temp;
	uint8_t i;
	uint8_t mode_temp;

	mode_temp = ((pecdsa_reg->ECDSA_ECR2_REG) & ECDSA_MASK_MODE_SEL) >> ECDSA_SHIFT_MODE_SEL;

	if (mode_temp == ECDSA_SIGN) {
		paddress_temp = (uint32_t *)(&(pecdsa_reg->ECDSA_ENG_Y_P0_REG));
		for (i = 0; i < 8; i++) {
			*(paddress_temp + i) = *(prdk + i);
		}
	} else {
		DBG_ECDSA_WARN("This mode doesn't need the random k. \r\n");
	}
}

/**
 *  @brief Set the public key of ECDSA.
 *
 *  @param[in] pecdsa_adapter The ECDSA adapter.
 *  @param[in] ppub_key_x Set the public key x.
 *  @param[in] ppub_key_y Set the public key y.
 *
 *  @returns void
 */
SECTION_ECDSA_TEXT
void hal_rtl_ecdsa_set_pbk(hal_ecdsa_adapter_t *pecdsa_adapter, uint32_t *ppub_key_x, uint32_t *ppub_key_y)
{
	ECDSA_TypeDef *pecdsa_reg = (ECDSA_TypeDef *)pecdsa_adapter->base_addr;
	uint32_t *paddress_temp;
	uint8_t i;
	uint8_t mode_temp;

	mode_temp = ((pecdsa_reg->ECDSA_ECR2_REG) & ECDSA_MASK_MODE_SEL) >> ECDSA_SHIFT_MODE_SEL;

	if (mode_temp == ECDSA_VERI) {
		paddress_temp = (uint32_t *)(&(pecdsa_reg->ECDSA_ENG_X_P0_REG));
		for (i = 0; i < 8; i++) {
			*(paddress_temp + i) = *(ppub_key_x + i);
		}
		paddress_temp = (uint32_t *)(&(pecdsa_reg->ECDSA_ENG_Y_P0_REG));
		for (i = 0; i < 8; i++) {
			*(paddress_temp + i) = *(ppub_key_y + i);
		}
	} else {
		DBG_ECDSA_WARN("This mode doesn't need the public key. \r\n");
	}
}

/**
 *  @brief Set the hash of ECDSA.
 *
 *  @param[in] pecdsa_adapter The ECDSA adapter.
 *  @param[in] phash Set the hash.
 *
 *  @returns void
 */
SECTION_ECDSA_TEXT
void hal_rtl_ecdsa_set_hash(hal_ecdsa_adapter_t *pecdsa_adapter, uint32_t *phash)
{
	ECDSA_TypeDef *pecdsa_reg = (ECDSA_TypeDef *)pecdsa_adapter->base_addr;
	uint32_t *paddress_temp;
	uint8_t i;
	uint8_t mode_temp;

	mode_temp = ((pecdsa_reg->ECDSA_ECR2_REG) & ECDSA_MASK_MODE_SEL) >> ECDSA_SHIFT_MODE_SEL;

	if ((mode_temp == ECDSA_VERI) || (mode_temp == ECDSA_SIGN)) {
		paddress_temp = (uint32_t *)(&(pecdsa_reg->ECDSA_ENG_H_P0_REG));
		for (i = 0; i < 8; i++) {
			*(paddress_temp + i) = *(phash + i);
		}
	} else {
		DBG_ECDSA_WARN("This mode doesn't need the hash. \r\n");
	}
}

/**
 *  @brief Set the R and S of ECDSA.
 *
 *  @param[in] pecdsa_adapter The ECDSA adapter.
 *  @param[in] pr_adr Set the R.
 *  @param[in] ps_adr Set the S.
 *
 *  @returns void
 */
SECTION_ECDSA_TEXT
void hal_rtl_ecdsa_set_rs(hal_ecdsa_adapter_t *pecdsa_adapter, uint32_t *pr_adr, uint32_t *ps_adr)
{
	ECDSA_TypeDef *pecdsa_reg = (ECDSA_TypeDef *)pecdsa_adapter->base_addr;
	uint32_t *paddress_temp;
	uint8_t i;
	uint8_t mode_temp;

	mode_temp = ((pecdsa_reg->ECDSA_ECR2_REG) & ECDSA_MASK_MODE_SEL) >> ECDSA_SHIFT_MODE_SEL;

	if (mode_temp == ECDSA_VERI) {
		paddress_temp = (uint32_t *)(&(pecdsa_reg->ECDSA_ENG_VERIFY_R_P0_REG));
		for (i = 0; i < 8; i++) {
			*(paddress_temp + i) = *(pr_adr + i);
		}
		paddress_temp = (uint32_t *)(&(pecdsa_reg->ECDSA_ENG_VERIFY_S_P0_REG));
		for (i = 0; i < 8; i++) {
			*(paddress_temp + i) = *(ps_adr + i);
		}
	} else {
		DBG_ECDSA_WARN("This mode doesn't need R and S. \r\n");
	}

}

/**
 *  @brief Set the base point of ECDSA.
 *
 *  @param[in] pecdsa_adapter The ECDSA adapter.
 *  @param[in] ppoint_x Set the base point X.
 *  @param[in] ppoint_y Set the base point y.
 *
 *  @returns void
 */
SECTION_ECDSA_TEXT
void hal_rtl_ecdsa_set_base_point(hal_ecdsa_adapter_t *pecdsa_adapter, uint32_t *ppoint_x, uint32_t *ppoint_y)
{
	ECDSA_TypeDef *pecdsa_reg = (ECDSA_TypeDef *)pecdsa_adapter->base_addr;
	uint32_t *paddress_temp;
	uint8_t i;
	uint8_t mode_temp;

	mode_temp = ((pecdsa_reg->ECDSA_ECR2_REG) & ECDSA_MASK_MODE_SEL) >> ECDSA_SHIFT_MODE_SEL;

	if ((mode_temp == ECDSA_VERI) || (mode_temp == ECDSA_SIGN)) {
		paddress_temp = (uint32_t *)(&(pecdsa_reg->ECDSA_ENG_GX_PS0_REG));
		for (i = 0; i < 8; i++) {
			*(paddress_temp + i) = *(ppoint_x + i);
		}
		paddress_temp = (uint32_t *)(&(pecdsa_reg->ECDSA_ENG_GY_PS0_REG));
		for (i = 0; i < 8; i++) {
			*(paddress_temp + i) = *(ppoint_y + i);
		}
	} else if ((mode_temp == ECDSA_SCALAR_MUL) || (mode_temp == ECDSA_BASIC_FUNC)) {
		paddress_temp = (uint32_t *)(&(pecdsa_reg->ECDSA_ENG_X_P0_REG));
		for (i = 0; i < 8; i++) {
			*(paddress_temp + i) = *(ppoint_x + i);
		}
		paddress_temp = (uint32_t *)(&(pecdsa_reg->ECDSA_ENG_Y_P0_REG));
		for (i = 0; i < 8; i++) {
			*(paddress_temp + i) = *(ppoint_y + i);
		}
	} else {
		DBG_ECDSA_WARN("This mode doesn't need the base point. \r\n");
	}

