swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom/rtl8735b_ecdsa.c
}

/**
 *  @brief Set the base point 2 of ECDSA for the basic mode.
 *
 *  @param[in] pecdsa_adapter The ECDSA adapter.
 *  @param[in] ppoint_x Set the base point2 X.
 *  @param[in] ppoint_y Set the base point2 y.
 *
 *  @returns void
 */
SECTION_ECDSA_TEXT
void hal_rtl_ecdsa_set_base_point_2(hal_ecdsa_adapter_t *pecdsa_adapter, uint32_t *ppoint_x, uint32_t *ppoint_y)
{
	ECDSA_TypeDef *pecdsa_reg = (ECDSA_TypeDef *)pecdsa_adapter->base_addr;
	uint32_t *paddress_temp;
	uint8_t i;
	uint8_t mode_temp;

	mode_temp = ((pecdsa_reg->ECDSA_ECR2_REG) & ECDSA_MASK_MODE_SEL) >> ECDSA_SHIFT_MODE_SEL;

	if (mode_temp == ECDSA_BASIC_FUNC) {
		paddress_temp = (uint32_t *)(&(pecdsa_reg->ECDSA_ENG_GX_PS0_REG));
		for (i = 0; i < 8; i++) {
			*(paddress_temp + i) = *(ppoint_x + i);
		}
		paddress_temp = (uint32_t *)(&(pecdsa_reg->ECDSA_ENG_GY_PS0_REG));
		for (i = 0; i < 8; i++) {
			*(paddress_temp + i) = *(ppoint_y + i);
		}
	} else {
		DBG_ECDSA_WARN("This mode doesn't need the base point 2. \r\n");
	}

}

/**
 *  @brief Set the "a" parameter of ECDSA.
 *
 *  @param[in] pecdsa_adapter The ECDSA adapter.
 *  @param[in] pa_adr Set the "a" parameter.
 *
 *  @returns void
 */
SECTION_ECDSA_TEXT
void hal_rtl_ecdsa_set_cor_a(hal_ecdsa_adapter_t *pecdsa_adapter, uint32_t *pa_adr)
{
	ECDSA_TypeDef *pecdsa_reg = (ECDSA_TypeDef *)pecdsa_adapter->base_addr;
	uint32_t *paddress_temp;
	uint8_t i;

	paddress_temp = (uint32_t *)(&(pecdsa_reg->ECDSA_ENG_A_P0_REG));
	for (i = 0; i < 8; i++) {
		*(paddress_temp + i) = *(pa_adr + i);
	}
}

/**
 *  @brief Set the prime of ECDSA.
 *
 *  @param[in] pecdsa_adapter The ECDSA adapter.
 *  @param[in] phash Set the prime.
 *
 *  @returns void
 */
SECTION_ECDSA_TEXT
void hal_rtl_ecdsa_set_prime(hal_ecdsa_adapter_t *pecdsa_adapter, uint32_t *pprime)
{
	ECDSA_TypeDef *pecdsa_reg = (ECDSA_TypeDef *)pecdsa_adapter->base_addr;
	uint32_t *paddress_temp;
	uint8_t i;

	paddress_temp = (uint32_t *)(&(pecdsa_reg->ECDSA_ENG_P_P0_REG));
	for (i = 0; i < 8; i++) {
		*(paddress_temp + i) = *(pprime + i);
	}
}

/**
 *  @brief Set the order_n of ECDSA.
 *
 *  @param[in] pecdsa_adapter The ECDSA adapter.
 *  @param[in] phash Set the order_n.
 *
 *  @returns void
 */
SECTION_ECDSA_TEXT
void hal_rtl_ecdsa_set_order_n(hal_ecdsa_adapter_t *pecdsa_adapter, uint32_t *porder_n)
{
	ECDSA_TypeDef *pecdsa_reg = (ECDSA_TypeDef *)pecdsa_adapter->base_addr;
	uint32_t *paddress_temp;
	uint8_t i;

	paddress_temp = (uint32_t *)(&(pecdsa_reg->ECDSA_ENG_N_P0_REG));
	for (i = 0; i < 8; i++) {
		*(paddress_temp + i) = *(porder_n + i);
	}
}

/**
 *  @brief Get the result x and y of ECDSA.
 *
 *  @param[in] pecdsa_adapter The ECDSA adapter.
 *  @param[in] prx_adr Get the result x.
 *  @param[in] pry_adr Get the result y.
 *
 *  @returns void
 */
SECTION_ECDSA_TEXT
void hal_rtl_ecdsa_get_result_x_y(hal_ecdsa_adapter_t *pecdsa_adapter, uint32_t *prx_adr, uint32_t *pry_adr)
{
	ECDSA_TypeDef *pecdsa_reg = (ECDSA_TypeDef *)pecdsa_adapter->base_addr;
	uint32_t *paddress_temp;
	uint8_t i;
	uint8_t mode_temp;

	mode_temp = ((pecdsa_reg->ECDSA_ECR2_REG) & ECDSA_MASK_MODE_SEL) >> ECDSA_SHIFT_MODE_SEL;

	if ((mode_temp == ECDSA_VERI) || (mode_temp == ECDSA_BASIC_FUNC)) {
		paddress_temp = (uint32_t *)(&(pecdsa_reg->ECDSA_ENG_XO_P0_REG));
		for (i = 0; i < 8; i++) {
			*(prx_adr + i) = *(paddress_temp + i);
		}
		paddress_temp = (uint32_t *)(&(pecdsa_reg->ECDSA_ENG_YO_P0_REG));
		for (i = 0; i < 8; i++) {
			*(pry_adr + i) = *(paddress_temp + i);
		}
	} else {
		DBG_ECDSA_WARN("This mode doesn't need result x and y. \r\n");
	}

}

/**
 *  @brief Get the verification result of ECDSA.
 *
 *  @param[in] pecdsa_adapter The ECDSA adapter.
 *
 *  @returns The verification result
 */
SECTION_ECDSA_TEXT
uint32_t hal_rtl_ecdsa_get_veri_result(hal_ecdsa_adapter_t *pecdsa_adapter)
{
	uint32_t r_temp;

	ECDSA_TypeDef *pecdsa_reg = (ECDSA_TypeDef *)pecdsa_adapter->base_addr;

	r_temp = ((pecdsa_reg->ECDSA_EISR_REG) & ECDSA_BIT_VERIFY_PASS) >> ECDSA_SHIFT_VERIFY_PASS;

	return r_temp;
}

/**
 *  @brief Get the verification error status of ECDSA.
 *
 *  @param[in] pecdsa_adapter The ECDSA adapter.
 *
 *  @returns The verification error status
 */
SECTION_ECDSA_TEXT
uint32_t hal_rtl_ecdsa_get_veri_err_sta(hal_ecdsa_adapter_t *pecdsa_adapter)
{
	uint32_t err_temp;

	ECDSA_TypeDef *pecdsa_reg = (ECDSA_TypeDef *)pecdsa_adapter->base_addr;

	err_temp = ((pecdsa_reg->ECDSA_EISR_REG) & ECDSA_MASK_VERIFY_ERR) >> ECDSA_SHIFT_VERIFY_ERR;

	return err_temp;
}

/**
 *  @brief Get the infinity error status of ECDSA.
 *
 *  @param[in] pecdsa_adapter The ECDSA adapter.
 *
 *  @returns The infinity error status
 */
SECTION_ECDSA_TEXT
uint32_t hal_rtl_ecdsa_get_inf_err_sta(hal_ecdsa_adapter_t *pecdsa_adapter)
{
	uint32_t err_temp;

	ECDSA_TypeDef *pecdsa_reg = (ECDSA_TypeDef *)pecdsa_adapter->base_addr;

	err_temp = ((pecdsa_reg->ECDSA_EISR_REG) & ECDSA_BIT_INFINITY_KEY) >> ECDSA_SHIFT_INFINITY_KEY;

	return err_temp;
}

/**
 *  @brief Get the finish status of ECDSA.
 *
 *  @param[in] pecdsa_adapter The ECDSA adapter.
 *
 *  @returns The finish status
 */
SECTION_ECDSA_TEXT
uint32_t hal_rtl_ecdsa_get_finish_sta(hal_ecdsa_adapter_t *pecdsa_adapter)
{
	uint32_t f_temp;

	ECDSA_TypeDef *pecdsa_reg = (ECDSA_TypeDef *)pecdsa_adapter->base_addr;

	f_temp = ((pecdsa_reg->ECDSA_EISR_REG) & ECDSA_BIT_FINISH_INT) >> ECDSA_SHIFT_FINISH_INT;

	return f_temp;
}

/**
 *  @brief Get the public key of ECDSA.
 *
 *  @param[in] pecdsa_adapter The ECDSA adapter.
 *  @param[in] ppub_key_x Get the public key x.
 *  @param[in] ppub_key_y Get the public key y.
 *
 *  @returns void
 */
SECTION_ECDSA_TEXT
void hal_rtl_ecdsa_get_pbk(hal_ecdsa_adapter_t *pecdsa_adapter, uint32_t *ppub_key_x, uint32_t *ppub_key_y)
{
	ECDSA_TypeDef *pecdsa_reg = (ECDSA_TypeDef *)pecdsa_adapter->base_addr;
	uint32_t *paddress_temp;
	uint8_t i;
	uint8_t mode_temp;

	mode_temp = ((pecdsa_reg->ECDSA_ECR2_REG) & ECDSA_MASK_MODE_SEL) >> ECDSA_SHIFT_MODE_SEL;

	if ((mode_temp == ECDSA_SIGN) || (mode_temp == ECDSA_SCALAR_MUL)) {
		paddress_temp = (uint32_t *)(&(pecdsa_reg->ECDSA_ENG_XO_P0_REG));
		for (i = 0; i < 8; i++) {
			*(ppub_key_x + i) = *(paddress_temp + i);
		}
		paddress_temp = (uint32_t *)(&(pecdsa_reg->ECDSA_ENG_YO_P0_REG));
		for (i = 0; i < 8; i++) {
			*(ppub_key_y + i) = *(paddress_temp + i);
		}
	} else {
		DBG_ECDSA_WARN("This mode doesn't need the public key. \r\n");
	}

