swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom/rtl8735b_ecdsa.c
}

/**
 *  @brief Get the R and S of ECDSA.
 *
 *  @param[in] pecdsa_adapter The ECDSA adapter.
 *  @param[in] pr_adr Get the R.
 *  @param[in] ps_adr Get the S.
 *
 *  @returns void
 */
SECTION_ECDSA_TEXT
void hal_rtl_ecdsa_get_rs(hal_ecdsa_adapter_t *pecdsa_adapter, uint32_t *pr_adr, uint32_t *ps_adr)
{
	ECDSA_TypeDef *pecdsa_reg = (ECDSA_TypeDef *)pecdsa_adapter->base_addr;
	uint32_t *paddress_temp;
	uint8_t i;
	uint8_t mode_temp;

	mode_temp = ((pecdsa_reg->ECDSA_ECR2_REG) & ECDSA_MASK_MODE_SEL) >> ECDSA_SHIFT_MODE_SEL;

	if (mode_temp == ECDSA_SIGN) {
		paddress_temp = (uint32_t *)(&(pecdsa_reg->ECDSA_ENG_SIGN_R_S0_REG));
		for (i = 0; i < 8; i++) {
			*(pr_adr + i) = *(paddress_temp + i);
		}
		paddress_temp = (uint32_t *)(&(pecdsa_reg->ECDSA_ENG_SIGN_S_S0_REG));
		for (i = 0; i < 8; i++) {
			*(ps_adr + i) = *(paddress_temp + i);
		}
	} else {
		DBG_ECDSA_WARN("This mode doesn't need R and S. \r\n");
	}

}

/**
 *  @brief Get the signature error status of ECDSA.
 *
 *  @param[in] pecdsa_adapter The ECDSA adapter.
 *
 *  @returns The signature error status
 */
SECTION_ECDSA_TEXT
uint32_t hal_rtl_ecdsa_get_sign_err_sta(hal_ecdsa_adapter_t *pecdsa_adapter)
{
	uint32_t err_temp;

	ECDSA_TypeDef *pecdsa_reg = (ECDSA_TypeDef *)pecdsa_adapter->base_addr;

	err_temp = ((pecdsa_reg->ECDSA_EISR_REG) & ECDSA_MASK_SIGN_ERR) >> ECDSA_SHIFT_SIGN_ERR;

	return err_temp;
}

/**
 *  @brief Get the scalar multiplication error status of ECDSA.
 *
 *  @param[in] pecdsa_adapter The ECDSA adapter.
 *
 *  @returns The scalar multiplication error status
 */
SECTION_ECDSA_TEXT
uint32_t hal_rtl_ecdsa_get_scal_mul_err_sta(hal_ecdsa_adapter_t *pecdsa_adapter)
{
	uint32_t err_temp;

	ECDSA_TypeDef *pecdsa_reg = (ECDSA_TypeDef *)pecdsa_adapter->base_addr;

	err_temp = ((pecdsa_reg->ECDSA_EISR_REG) & ECDSA_BIT_SHARE_KEY_ERR) >> ECDSA_SHIFT_SHARE_KEY_ERR;

	return err_temp;
}

/**
 *  @brief Get the error status of ECDSA according to different modes.
 *
 *  @param[in] pecdsa_adapter The ECDSA adapter.
 *
 *  @returns The error status
 */
SECTION_ECDSA_TEXT
uint32_t hal_rtl_ecdsa_get_err_sta(hal_ecdsa_adapter_t *pecdsa_adapter)
{
	ECDSA_TypeDef *pecdsa_reg = (ECDSA_TypeDef *)pecdsa_adapter->base_addr;
	uint8_t mode_temp;
	uint32_t err_temp, err_temp1;

	mode_temp = ((pecdsa_reg->ECDSA_ECR2_REG) & ECDSA_MASK_MODE_SEL) >> ECDSA_SHIFT_MODE_SEL;

	switch (mode_temp) {
	case ECDSA_VERI:
		err_temp = ((pecdsa_reg->ECDSA_EISR_REG) & ECDSA_MASK_VERIFY_ERR) >> ECDSA_SHIFT_VERIFY_ERR;
		break;
	case ECDSA_SIGN:
		err_temp = ((pecdsa_reg->ECDSA_EISR_REG) & ECDSA_MASK_SIGN_ERR) >> ECDSA_SHIFT_SIGN_ERR;
		break;
	case ECDSA_SCALAR_MUL:
		err_temp = ((pecdsa_reg->ECDSA_EISR_REG) & ECDSA_BIT_SHARE_KEY_ERR) >> ECDSA_SHIFT_SHARE_KEY_ERR;
		break;
	default :
		err_temp = 0;
		break;
	}

	err_temp1 = ((pecdsa_reg->ECDSA_EISR_REG) & ECDSA_BIT_INFINITY_KEY) >> ECDSA_SHIFT_INFINITY_KEY;

	err_temp = err_temp | (err_temp1 << 1);

	return err_temp;
}

/**
 *  @brief Get the error status of ECDSA according to different modes.
 *
 *  @param[in] pecdsa_adapter The ECDSA adapter.
 *
 *  @returns The idle status
 */
SECTION_ECDSA_TEXT
uint32_t hal_rtl_ecdsa_get_idle_sta(hal_ecdsa_adapter_t *pecdsa_adapter)
{
	uint32_t err_temp;

	ECDSA_TypeDef *pecdsa_reg = (ECDSA_TypeDef *)pecdsa_adapter->base_addr;

	err_temp = ((pecdsa_reg->ECDSA_EISR_REG) & ECDSA_BIT_ENG_IDLE) >> ECDSA_SHIFT_ENG_IDLE;

	return err_temp;
}

/**
 *  @brief Excute the verification of ECDSA.
 *
 *  @param[in] pecdsa_adapter The ECDSA adapter.
 *  @param[in] pveri_input Set verification inputs.
 *
 *  @returns void
 */
SECTION_ECDSA_TEXT
void hal_rtl_ecdsa_verify(hal_ecdsa_adapter_t *pecdsa_adapter, hal_ecdsa_veri_input_t *pveri_input)
{
	hal_rtl_ecdsa_set_mode(pecdsa_adapter, ECDSA_VERI, ECDSA_NONE);

	hal_rtl_ecdsa_set_pbk(pecdsa_adapter, pveri_input->ppub_key_x, pveri_input->ppub_key_y);

	hal_rtl_ecdsa_set_rs(pecdsa_adapter, pveri_input->pr_adr, pveri_input->ps_adr);

	hal_rtl_ecdsa_start_en(pecdsa_adapter, ENABLE);
}

/**
 *  @brief Excute the signature of ECDSA.
 *
 *  @param[in] pecdsa_adapter The ECDSA adapter.
 *  @param[in] ppriv_key Set the private key.
 *  @param[in] prdk Set the random k.
 *
 *  @returns void
 */
SECTION_ECDSA_TEXT
void hal_rtl_ecdsa_signature(hal_ecdsa_adapter_t *pecdsa_adapter, uint32_t *ppriv_key, uint32_t *prdk)
{
	hal_rtl_ecdsa_set_mode(pecdsa_adapter, ECDSA_SIGN, ECDSA_NONE);

	hal_rtl_ecdsa_set_prk(pecdsa_adapter, ppriv_key);

	hal_rtl_ecdsa_set_random_k(pecdsa_adapter, prdk);

	hal_rtl_ecdsa_start_en(pecdsa_adapter, ENABLE);
}

/**
 *  @brief Set the hash is ready.
 *
 *  @param[in] pecdsa_adapter The ECDSA adapter.
 *  @param[in] phash Set the hash.
 *
 *  @returns void
 */
SECTION_ECDSA_TEXT
void hal_rtl_ecdsa_hash(hal_ecdsa_adapter_t *pecdsa_adapter, uint32_t *phash)
{
	hal_rtl_ecdsa_set_hash(pecdsa_adapter, phash);

	hal_rtl_ecdsa_hash_en(pecdsa_adapter, ENABLE);
}

/**
 *  @brief Generate the public key of ECDSA.
 *
 *  @param[in] pecdsa_adapter The ECDSA adapter.
 *  @param[in] ppriv_key Set the private key.
 *  @param[in] ppoint_x Set the base point X.
 *  @param[in] ppoint_y Set the base point y.
 *
 *  @returns void
 */
SECTION_ECDSA_TEXT
void hal_rtl_ecdsa_gen_public_key(hal_ecdsa_adapter_t *pecdsa_adapter, uint32_t *ppriv_key, uint32_t *ppoint_x, uint32_t *ppoint_y)
{
	hal_rtl_ecdsa_set_mode(pecdsa_adapter, ECDSA_SCALAR_MUL, ECDSA_NONE);

	hal_rtl_ecdsa_set_prk(pecdsa_adapter, ppriv_key);

	hal_rtl_ecdsa_set_base_point(pecdsa_adapter, ppoint_x, ppoint_y);

	hal_rtl_ecdsa_start_en(pecdsa_adapter, ENABLE);

}

/**
 *  @brief Register the ECDSA callback function and argument.
 *
 *  @param[in] pecdsa_adapter The ECDSA adapter.
 *  @param[in]  callback The callback function.
 *  @param[in]  arg The callback argument.
 *  @returns void
 */
SECTION_ECDSA_TEXT
void hal_rtl_ecdsa_cb_handler(hal_ecdsa_adapter_t *pecdsa_adapter, ecdsa_irq_user_cb_t callback, void *arg)
{
	if (callback != NULL) {
		pecdsa_adapter->ecdsa_irq_user_cb = callback;
		pecdsa_adapter->ecdsa_user_arg = arg;
	}
}

/** @} */ /* End of group hal_rtl_ecdsa_func */
/// @endcond /* End of condition DOXYGEN_ROM_HAL_API */

/** @} */ /* End of group hal_rtl_ecdsa */


#endif  // end of "#if CONFIG_ECDSA_EN"

